""" Lab_01

    Answer the questions:
        1) Алгоритм це це точна послідовність дій,
        яка за кінцеве число кроків веде від довільного вхідного даного
        до досягнення результату, який повністю визначається цими вхідними даними.

        2) Властивості:
            * трудомісткість
            * складність
            * продуктивність

        3) Трудомісткість характеризує витрати часу
        для реалізації алгоритму на деякій сукупності технічних засобів.

        4)

        5) складність – це функція залежності обсягу роботи,
        виконуваної деяким алгоритмом, від розміру вхідних данних.

        6) Оцінка складності алгоритму може бути дана в бітах, байтах, кількості символів певної мови.
        Складність алгоритму та кількість даних характеризують потребу задачі в оперативній та зовнішній пам’яті.

        7) трудомісткість алгоритму це кількість обчислювальної роботи, необхідної для його реалізації.

        8) Трудомісткість характеризує витрати часу для реалізації алгоритму на деякій сукупності технічних засобів.
        Зазвичай трудомісткість оцінюється кількістю процесорних операцій і операцій введення-виведення.

        9) бо вона залежить від вхідних даних.

        10) Трудомісткість алгоритму приблизно може бути визначена як середня кількість
        процесорних операцій (Θ), необхідних для виконання алгоритму один раз.
        Також  операціі введення-виведення, за необхідності можуть бути додані інші параметри.

        11) номер вершини повинен бути таким, щоб вхідні в цю вершину дуги починалися у вершинах з меншими номерами.

        12) Таблиця з імовірностями переходів між станами.

        13) Для визначення середнього числа процесорних операцій, виконуваних за один прогін програми,
        треба граф алгоритму записати у вигляді стохастичної матриці P.

        14) Якщо відповідну ймовірність позначити через p,
        то ймовірність виходу з логічної вершини при нульовому логічному значенні умови (false),
        що перевіряється, буде дорівнювати 1 - p.

        15) Для визначення середньої кількості звертань.
"""
